/*********************************************************************
* 版权所有 (C)2023, 成都XXXX有限公司。
* 
* 文件名称： // TaskManage.h
* 文件标识： // 
* 内容摘要： // 焊机内部器件控制
* 其它说明： // 
* 当前版本： // V1.0
* 作     者：// 0001
* 完成日期： // 20230104
* 
* 修改记录
* 修改日期：
* 修 改 人：
* 修改内容： 
**********************************************************************/
#ifndef __TASKMANAGE_H
#define __TASKMANAGE_H

/**********************************************************************
* 函数名称： // void TaskManage(void)
* 功能描述： // 任务管理器
* 访问的表： //
* 修改的表： //
* 输入参数： // 无
* 输入参数： // 无
* 输入参数： // 
* 输入参数： // 
* 输出参数： // 
* 返 回 值： // 无
* 其它说明： // 1s更新一次
* 修改日期       修改人	     修改内容
* -----------------------------------------------
* 2022/11/14	     0001	      XXX
***********************************************************************/
void TaskManage(void);

#endif
